In [1]:
import pandas as pd

# PANDA DATA

### Create Data

In [2]:
data = {
    'Name':['Pandy','Sandy','Randy','Mandy','Candy','Landy'],
    'Age':[6,7,4,5,4,2],
    'Bamboo Stick': [10,15,20,25,30,35]
}

In [3]:
df=pd.DataFrame(data)

In [4]:
df

    Name  Age  Bamboo Stick
0  Pandy    6            10
1  Sandy    7            15
2  Randy    4            20
3  Mandy    5            25
4  Candy    4            30
5  Landy    2            35

### shape

In [5]:
df.shape

(6, 3)

### info

In [6]:
df.info

<bound method DataFrame.info of     Name  Age  Bamboo Stick
0  Pandy    6            10
1  Sandy    7            15
2  Randy    4            20
3  Mandy    5            25
4  Candy    4            30
5  Landy    2            35>

### Head (first five rows)

In [7]:
df.head()

    Name  Age  Bamboo Stick
0  Pandy    6            10
1  Sandy    7            15
2  Randy    4            20
3  Mandy    5            25
4  Candy    4            30

In [8]:
df.head(2)

    Name  Age  Bamboo Stick
0  Pandy    6            10
1  Sandy    7            15

### Tail (last five rows)

In [9]:
df.tail()

    Name  Age  Bamboo Stick
1  Sandy    7            15
2  Randy    4            20
3  Mandy    5            25
4  Candy    4            30
5  Landy    2            35

In [10]:
df.tail(3)

    Name  Age  Bamboo Stick
3  Mandy    5            25
4  Candy    4            30
5  Landy    2            35

### Filtering

In [11]:
df[['Name']]

    Name
0  Pandy
1  Sandy
2  Randy
3  Mandy
4  Candy
5  Landy

#### Logical

In [12]:
filter_panda=df[df['Age']<5]

In [13]:
filter_panda  #renaming helps to keep the original data

    Name  Age  Bamboo Stick
2  Randy    4            20
4  Candy    4            30
5  Landy    2            35

df[df['Age']<5] 
df, data frame name used for filtering
[df['Age']<5] is the logic

#### Multiple Filtering

In [14]:
df[['Bamboo Stick','Age']]

   Bamboo Stick  Age
0            10    6
1            15    7
2            20    4
3            25    5
4            30    4
5            35    2

#### Multiple Logic

In [15]:
df[ (df['Age']>4) & (df['Bamboo Stick']>10) ]

    Name  Age  Bamboo Stick
1  Sandy    7            15
3  Mandy    5            25

### Add Column

In [16]:
df['Place']=['Greenland', 'Siberia', 'Antartica','Greenland', 'Siberia', 'Antartica']

In [17]:
df

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica
3  Mandy    5            25  Greenland
4  Candy    4            30    Siberia
5  Landy    2            35  Antartica

### Drop Duplicate

In [18]:
df.drop_duplicates(subset=['Place'])

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica

In [19]:
df.drop_duplicates(subset=['Place'],keep='first' )

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica

In [20]:
df.drop_duplicates(subset=['Place'],keep='last' )

    Name  Age  Bamboo Stick      Place
3  Mandy    5            25  Greenland
4  Candy    4            30    Siberia
5  Landy    2            35  Antartica

### Vlaue Counts

In [21]:
df['Place'].value_counts()

Place
Greenland    2
Siberia      2
Antartica    2
Name: count, dtype: int64

In [22]:
df['Age'].value_counts()

Age
4    2
6    1
7    1
5    1
2    1
Name: count, dtype: int64

### Transpose

In [23]:
df.T

                      0        1          2          3        4          5
Name              Pandy    Sandy      Randy      Mandy    Candy      Landy
Age                   6        7          4          5        4          2
Bamboo Stick         10       15         20         25       30         35
Place         Greenland  Siberia  Antartica  Greenland  Siberia  Antartica

### Update (loc)

In [24]:
df.loc[df['Name']== 'Pandy', 'Age']=6

In [25]:
df

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica
3  Mandy    5            25  Greenland
4  Candy    4            30    Siberia
5  Landy    2            35  Antartica

df.loc is the function name, df is the name of the dataframe
[df['Name']== 'Pandy', 'Age'] tracks row location
['Name']== 'Pandy' Row information
=6 is the updated value

#### Delete one Column

In [26]:
df.drop('Place',axis=1)

    Name  Age  Bamboo Stick
0  Pandy    6            10
1  Sandy    7            15
2  Randy    4            20
3  Mandy    5            25
4  Candy    4            30
5  Landy    2            35

In [27]:
#### Delete multiple Column

In [28]:
#df.drop(['Place','Bamboo Stick'],axis=1)

#### Delete Row

In [29]:
df

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica
3  Mandy    5            25  Greenland
4  Candy    4            30    Siberia
5  Landy    2            35  Antartica

In [30]:
 df.drop(df[df['Name'] == 'Candy'].index)

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica
3  Mandy    5            25  Greenland
5  Landy    2            35  Antartica

✅ df[df['Name'] == 'Sandy'].index gives you the actual row index/indices where Name == 'Sandy'.
🔍 .index in pandas is used to access the row labels (i.e., the indices) of a DataFrame or Series.

In [31]:
df

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica
3  Mandy    5            25  Greenland
4  Candy    4            30    Siberia
5  Landy    2            35  Antartica

### iloc

### show row data

In [32]:
df.iloc[2]

Name                Randy
Age                     4
Bamboo Stick           20
Place           Antartica
Name: 2, dtype: object

In [33]:
df.iloc[:3]

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica

In [34]:
df.iloc[1:3]

    Name  Age  Bamboo Stick      Place
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica

### show coulmn data

In [35]:
df ['Place']

0    Greenland
1      Siberia
2    Antartica
3    Greenland
4      Siberia
5    Antartica
Name: Place, dtype: object

#### row and column

In [36]:
df.iloc [0:2,1:3]

   Age  Bamboo Stick
0    6            10
1    7            15

###  New index

In [37]:
import pandas as pd

df = pd.DataFrame(
    {
        'Name': ['Pandy', 'Sandy', 'Randy', 'Mandy', 'Candy', 'Landy'],
        'Age': [6, 7, 4, 5, 4, 2],
        'Bamboo Stick': [10, 15, 20, 25, 30, 35]
    },
    index=['a', 'b', 'c', 'd', 'e', 'f']
)

In [38]:
df

    Name  Age  Bamboo Stick
a  Pandy    6            10
b  Sandy    7            15
c  Randy    4            20
d  Mandy    5            25
e  Candy    4            30
f  Landy    2            35

### loc

#### column

In [39]:
df.loc['b']

Name            Sandy
Age                 7
Bamboo Stick       15
Name: b, dtype: object

#### both row & column

In [40]:
df.loc[['b','c'], ['Name','Age']]

    Name  Age
b  Sandy    7
c  Randy    4

### Conevrt to csv

In [41]:
df.to_csv('panda.csv')

We would see a csv file on the local folder

#### No index

In [42]:
df.to_csv('noIndex_panda.csv', index=False)

In [43]:
df

    Name  Age  Bamboo Stick
a  Pandy    6            10
b  Sandy    7            15
c  Randy    4            20
d  Mandy    5            25
e  Candy    4            30
f  Landy    2            35

### Statistical Analysis

In [44]:
df.describe()

            Age  Bamboo Stick
count  6.000000      6.000000
mean   4.666667     22.500000
std    1.751190      9.354143
min    2.000000     10.000000
25%    4.000000     16.250000
50%    4.500000     22.500000
75%    5.750000     28.750000
max    7.000000     35.000000

# EXERCISE SESSION

### Json

In [45]:
df_json=pd.read_json('test.json')

In [46]:
df_json

   Duration  Pulse  Maxpulse  Calories
0        60    110       130       409
1        60    117       145       479
2        60    103       135       340
3        45    109       175       282
4        45    117       148       406
5        60    102       127       300

In [47]:
df_json.head()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130       409
1        60    117       145       479
2        60    103       135       340
3        45    109       175       282
4        45    117       148       406

### shape

In [48]:
df_json.shape

(6, 4)

### Read CSV

In [49]:
df_json.to_csv("test_excel.csv",index=False)

In [50]:
df_csv=pd.read_csv("test_excel.csv")

In [51]:
df_csv

   Duration  Pulse  Maxpulse  Calories
0        60    110       130       409
1        60    117       145       479
2        60    103       135       340
3        45    109       175       282
4        45    117       148       406
5        60    102       127       300

### excel convert

In [52]:
df_excel=df_csv.drop('Calories',axis=1)

In [53]:
df_excel

   Duration  Pulse  Maxpulse
0        60    110       130
1        60    117       145
2        60    103       135
3        45    109       175
4        45    117       148
5        60    102       127

pip install openpyxl

In [54]:
df_excel.to_excel("output.xlsx",index=False)

In [55]:
df_excel

   Duration  Pulse  Maxpulse
0        60    110       130
1        60    117       145
2        60    103       135
3        45    109       175
4        45    117       148
5        60    102       127

### Read Excel

In [56]:
read_excel=pd.read_excel("output.xlsx")

In [57]:
#read_excel=pd.read_excel("output.xlsx",sheet_name='Sheet1')

In [58]:
read_excel

   Duration  Pulse  Maxpulse
0        60    110       130
1        60    117       145
2        60    103       135
3        45    109       175
4        45    117       148
5        60    102       127

###  Data Merge

In [59]:
left= pd.DataFrame({
    'ID': [1,2,3],
    'Name': ['Pandy', 'Mandy',' Sandy']
})
right= pd.DataFrame({
    'ID': [1,2,4],
    'Hobby': ['Eating', 'Dancing',' Sleeping']
})

In [60]:
merged_df=pd.merge(left,right, on='ID', how='inner')

In [61]:
merged_df

   ID   Name    Hobby
0   1  Pandy   Eating
1   2  Mandy  Dancing

### concat

### row

In [62]:
concat_df=pd.concat([left,right],ignore_index=True) #ignore index helps to prevent overflow of index

In [63]:
concat_df

   ID    Name      Hobby
0   1   Pandy        NaN
1   2   Mandy        NaN
2   3   Sandy        NaN
3   1     NaN     Eating
4   2     NaN    Dancing
5   4     NaN   Sleeping

### coulmn

In [64]:
concat_df=pd.concat([left,right],axis=1)

In [65]:
concat_df

   ID    Name  ID      Hobby
0   1   Pandy   1     Eating
1   2   Mandy   2    Dancing
2   3   Sandy   4   Sleeping

#  NUMERICAL RANDOM DATA

### Series

In [66]:
import numpy as np

In [67]:
ser = pd.Series(np.random.rand(34))

In [68]:
ser

0     0.011530
1     0.824112
2     0.068168
3     0.445698
4     0.952090
5     0.435940
6     0.695846
7     0.383026
8     0.098579
9     0.504499
10    0.148177
11    0.346438
12    0.156651
13    0.065381
14    0.861100
15    0.125946
16    0.371857
17    0.411425
18    0.850154
19    0.648880
20    0.401752
21    0.150534
22    0.346891
23    0.668853
24    0.883404
25    0.777047
26    0.791406
27    0.868278
28    0.724478
29    0.316670
30    0.766297
31    0.184154
32    0.151446
33    0.142646
dtype: float64

In [69]:
type(ser)

pandas.core.series.Series

### Data Frame

In [70]:
newdf = pd.DataFrame(np.random.rand(334,5))

In [71]:
newdf

            0         1         2         3         4
0    0.516614  0.488951  0.433020  0.378738  0.371772
1    0.626618  0.229953  0.169730  0.766995  0.960482
2    0.853829  0.411584  0.943102  0.856882  0.996414
3    0.134716  0.976429  0.155937  0.048860  0.277569
4    0.073508  0.022575  0.594167  0.805189  0.826903
..        ...       ...       ...       ...       ...
329  0.310449  0.715551  0.785609  0.439789  0.949611
330  0.573966  0.110109  0.355690  0.470735  0.570344
331  0.789885  0.357375  0.809132  0.949304  0.936393
332  0.221770  0.393803  0.379100  0.252413  0.125056
333  0.502211  0.100001  0.807844  0.288548  0.188758

[334 rows x 5 columns]

In [72]:
type(newdf)

pandas.core.frame.DataFrame

In [73]:
newdf.index

RangeIndex(start=0, stop=334, step=1)

In [74]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

### Convert to Numpy

In [75]:
newdf.to_numpy()

array([[0.51661376, 0.48895086, 0.43301962, 0.37873816, 0.37177242],
       [0.62661759, 0.22995304, 0.16972954, 0.7669955 , 0.96048169],
       [0.85382913, 0.41158375, 0.9431022 , 0.85688183, 0.99641392],
       ...,
       [0.78988537, 0.35737455, 0.80913208, 0.94930438, 0.93639266],
       [0.22176998, 0.39380348, 0.37909972, 0.25241341, 0.12505645],
       [0.5022112 , 0.10000063, 0.80784449, 0.28854834, 0.18875802]],
      shape=(334, 5))

In [76]:
newdf.head()

          0         1         2         3         4
0  0.516614  0.488951  0.433020  0.378738  0.371772
1  0.626618  0.229953  0.169730  0.766995  0.960482
2  0.853829  0.411584  0.943102  0.856882  0.996414
3  0.134716  0.976429  0.155937  0.048860  0.277569
4  0.073508  0.022575  0.594167  0.805189  0.826903

### Sort

In [77]:
sortdf = pd.DataFrame(np.random.randint(0,50,size=(334,5)))

In [78]:
sortdf

      0   1   2   3   4
0     9  12  43  29  28
1    35  35  16   7   1
2    36  43  32   6  21
3    48  29  26  17  18
4    49   8  47  47  29
..   ..  ..  ..  ..  ..
329  31   4   9   0  49
330  20  18   8  49  19
331  29   5  39  15  35
332  17  46  19  21  47
333  14  30   7  25  49

[334 rows x 5 columns]

In [79]:
sortdf.head()

    0   1   2   3   4
0   9  12  43  29  28
1  35  35  16   7   1
2  36  43  32   6  21
3  48  29  26  17  18
4  49   8  47  47  29

In [80]:
sortdf.sort_index(axis=1,ascending=False) # To Column

      4   3   2   1   0
0    28  29  43  12   9
1     1   7  16  35  35
2    21   6  32  43  36
3    18  17  26  29  48
4    29  47  47   8  49
..   ..  ..  ..  ..  ..
329  49   0   9   4  31
330  19  49   8  18  20
331  35  15  39   5  29
332  47  21  19  46  17
333  49  25   7  30  14

[334 rows x 5 columns]

In [81]:
sortdf.sort_index(axis=0,ascending=False) # To Row

      0   1   2   3   4
333  14  30   7  25  49
332  17  46  19  21  47
331  29   5  39  15  35
330  20  18   8  49  19
329  31   4   9   0  49
..   ..  ..  ..  ..  ..
4    49   8  47  47  29
3    48  29  26  17  18
2    36  43  32   6  21
1    35  35  16   7   1
0     9  12  43  29  28

[334 rows x 5 columns]

In [82]:
type(sortdf)

pandas.core.frame.DataFrame

In [83]:
type(sortdf[0])

pandas.core.series.Series

### Update Value (loc)

In [84]:
sortdf.loc[0,0]=654

In [85]:
sortdf

       0   1   2   3   4
0    654  12  43  29  28
1     35  35  16   7   1
2     36  43  32   6  21
3     48  29  26  17  18
4     49   8  47  47  29
..   ...  ..  ..  ..  ..
329   31   4   9   0  49
330   20  18   8  49  19
331   29   5  39  15  35
332   17  46  19  21  47
333   14  30   7  25  49

[334 rows x 5 columns]

In [86]:
sortdf.columns=list("ABCDE")

In [87]:
sortdf

       A   B   C   D   E
0    654  12  43  29  28
1     35  35  16   7   1
2     36  43  32   6  21
3     48  29  26  17  18
4     49   8  47  47  29
..   ...  ..  ..  ..  ..
329   31   4   9   0  49
330   20  18   8  49  19
331   29   5  39  15  35
332   17  46  19  21  47
333   14  30   7  25  49

[334 rows x 5 columns]

In [88]:
sortdf.loc[0,'B']=774

In [89]:
sortdf

       A    B   C   D   E
0    654  774  43  29  28
1     35   35  16   7   1
2     36   43  32   6  21
3     48   29  26  17  18
4     49    8  47  47  29
..   ...  ...  ..  ..  ..
329   31    4   9   0  49
330   20   18   8  49  19
331   29    5  39  15  35
332   17   46  19  21  47
333   14   30   7  25  49

[334 rows x 5 columns]

In [90]:
sortdf.loc[:,:] # to see all the row and column values

       A    B   C   D   E
0    654  774  43  29  28
1     35   35  16   7   1
2     36   43  32   6  21
3     48   29  26  17  18
4     49    8  47  47  29
..   ...  ...  ..  ..  ..
329   31    4   9   0  49
330   20   18   8  49  19
331   29    5  39  15  35
332   17   46  19  21  47
333   14   30   7  25  49

[334 rows x 5 columns]

### Single Condition

In [91]:
sortdf.loc[(sortdf['A']>48)]

       A    B   C   D   E
0    654  774  43  29  28
4     49    8  47  47  29
44    49    3  25  18  20
59    49   47  37  33  18
90    49    9  19  42  41
106   49   36  10   3  12
129   49   35  13   4  34
158   49   19   3   8   6

### Multiple Condition

In [92]:
sortdf.loc[(sortdf['A']>48) & (sortdf['C']>40)]

     A    B   C   D   E
0  654  774  43  29  28
4   49    8  47  47  29

### iloc

In [93]:
sortdf.iloc[0,4]

np.int32(28)

In [94]:
newdf.iloc[[0,225],[0,2]]

            0        2
0    0.516614  0.43302
225  0.662746  0.29042

| Feature                | `.loc`                                                             | `.iloc`                                                                 |
| ---------------------- | ------------------------------------------------------------------ | ----------------------------------------------------------------------- |
| **Type of indexing**   | **Label-based** → You select rows/columns by their names (labels). | **Integer-based** → You select rows/columns by their integer positions. |
| **Inclusive behavior** | Both start and end labels are **inclusive** when slicing.          | The end index is **exclusive** when slicing (like Python list slicing). |
| **Accepts**            | Row/column labels, boolean arrays, slices with labels.             | Row/column integer positions, boolean arrays, slices with integers.     |
| **Errors**             | Throws `KeyError` if label is not found.                           | Throws `IndexError` if index is out of range.                           |

### drop

### row

In [95]:
sortdf.drop(2)

       A    B   C   D   E
0    654  774  43  29  28
1     35   35  16   7   1
3     48   29  26  17  18
4     49    8  47  47  29
5     47   12  36  40  38
..   ...  ...  ..  ..  ..
329   31    4   9   0  49
330   20   18   8  49  19
331   29    5  39  15  35
332   17   46  19  21  47
333   14   30   7  25  49

[333 rows x 5 columns]

### column

In [96]:
sortdf.drop(['E'],axis=1)

       A    B   C   D
0    654  774  43  29
1     35   35  16   7
2     36   43  32   6
3     48   29  26  17
4     49    8  47  47
..   ...  ...  ..  ..
329   31    4   9   0
330   20   18   8  49
331   29    5  39  15
332   17   46  19  21
333   14   30   7  25

[334 rows x 4 columns]

### Permanently Drop Column

In [97]:
sortdf.drop(['D'],axis=1,inplace=True)

In [98]:
sortdf

       A    B   C   E
0    654  774  43  28
1     35   35  16   1
2     36   43  32  21
3     48   29  26  18
4     49    8  47  29
..   ...  ...  ..  ..
329   31    4   9  49
330   20   18   8  19
331   29    5  39  35
332   17   46  19  47
333   14   30   7  49

[334 rows x 4 columns]

### Permanently Drop Row

In [99]:
sortdf.drop([2,3],axis=0,inplace=True)

In [100]:
sortdf

       A    B   C   E
0    654  774  43  28
1     35   35  16   1
4     49    8  47  29
5     47   12  36  38
6     12   48  27   8
..   ...  ...  ..  ..
329   31    4   9  49
330   20   18   8  19
331   29    5  39  35
332   17   46  19  47
333   14   30   7  49

[332 rows x 4 columns]

### Reset Rows

In [101]:
sortdf.reset_index() #adds an extra index

     index    A    B   C   E
0        0  654  774  43  28
1        1   35   35  16   1
2        4   49    8  47  29
3        5   47   12  36  38
4        6   12   48  27   8
..     ...  ...  ...  ..  ..
327    329   31    4   9  49
328    330   20   18   8  19
329    331   29    5  39  35
330    332   17   46  19  47
331    333   14   30   7  49

[332 rows x 5 columns]

In [102]:
sortdf.reset_index(drop=True)#drops the extra index

       A    B   C   E
0    654  774  43  28
1     35   35  16   1
2     49    8  47  29
3     47   12  36  38
4     12   48  27   8
..   ...  ...  ..  ..
327   31    4   9  49
328   20   18   8  19
329   29    5  39  35
330   17   46  19  47
331   14   30   7  49

[332 rows x 4 columns]

### Null

In [103]:
sortdf.loc[4]=None

In [104]:
sortdf

         A      B     C     E
0    654.0  774.0  43.0  28.0
1     35.0   35.0  16.0   1.0
4      NaN    NaN   NaN   NaN
5     47.0   12.0  36.0  38.0
6     12.0   48.0  27.0   8.0
..     ...    ...   ...   ...
329   31.0    4.0   9.0  49.0
330   20.0   18.0   8.0  19.0
331   29.0    5.0  39.0  35.0
332   17.0   46.0  19.0  47.0
333   14.0   30.0   7.0  49.0

[332 rows x 4 columns]

In [105]:
sortdf.loc[4].isnull() #check

A    True
B    True
C    True
E    True
Name: 4, dtype: bool

# TRAIN

In [106]:
df=pd.read_csv("train.csv")

In [107]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q